miketeachman/micropython/ports/mimxrt/machine_i2s.c
        return true;
    } else {
        return false;
    }
    
#endif
    return true;  // TODO to get it compiling

}

#if 0
void HAL_I2S_ErrorCallback(I2S_HandleTypeDef *hi2s) {
    uint32_t errorCode = HAL_I2S_GetError(hi2s);
    printf("I2S Error = %ld\n", errorCode);
}
#endif

#if 0
void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s) {
#else    
void HAL_I2S_RxCpltCallback(void) {
#endif        
    machine_i2s_obj_t *self;
#if 0
    if (hi2s->Instance == I2S1) {
#else
    if(1) {
#endif        
        self = MP_STATE_PORT(machine_i2s_obj)[0];
    } else {
        self = MP_STATE_PORT(machine_i2s_obj)[1];
    }
    // bottom half of buffer now filled,
    // safe to empty the bottom half while the top half of buffer is being filled
    empty_dma(self, BOTTOM_HALF);

    // for non-blocking operation, this IRQ-based callback handles
    // the readinto() method requests.
    if ((self->io_mode == NON_BLOCKING) && (self->non_blocking_descriptor.copy_in_progress)) {
        fill_appbuf_from_ringbuf_non_blocking(self);
    }
}

#if 0
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s) {
#else
void HAL_I2S_RxHalfCpltCallback(void) {
#endif    
    machine_i2s_obj_t *self;
#if 0
    if (hi2s->Instance == I2S1) {
#else
    if(1) {
#endif        
        self = MP_STATE_PORT(machine_i2s_obj)[0];
    } else {
        self = MP_STATE_PORT(machine_i2s_obj)[1];
    }
    // top half of buffer now filled,
    // safe to empty the top half while the bottom half of buffer is being filled
    empty_dma(self, TOP_HALF);

    // for non-blocking operation, this IRQ-based callback handles
    // the readinto() method requests.
    if ((self->io_mode == NON_BLOCKING) && (self->non_blocking_descriptor.copy_in_progress)) {
        fill_appbuf_from_ringbuf_non_blocking(self);
    }
}

#if 0
void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s) {
#else    
void HAL_I2S_TxCpltCallback(void) {
#endif    
    machine_i2s_obj_t *self;
#if 0
    if (hi2s->Instance == I2S1) {
#else
    if(1) {
#endif        
        self = MP_STATE_PORT(machine_i2s_obj)[0];
    } else {
        self = MP_STATE_PORT(machine_i2s_obj)[1];
    }
    // for non-blocking operation, this IRQ-based callback handles
    // the write() method requests.
    if ((self->io_mode == NON_BLOCKING) && (self->non_blocking_descriptor.copy_in_progress)) {
        copy_appbuf_to_ringbuf_non_blocking(self);
    }

    // bottom half of buffer now emptied,
    // safe to fill the bottom half while the top half of buffer is being emptied
    feed_dma(self, BOTTOM_HALF);
}

#if 0
void HAL_I2S_TxHalfCpltCallback(I2S_HandleTypeDef *hi2s) {
#else    
void HAL_I2S_TxHalfCpltCallback(void) {
#endif    
    machine_i2s_obj_t *self;
#if 0
    if (hi2s->Instance == I2S1) {
#else
    if(1) {
#endif        
        self = MP_STATE_PORT(machine_i2s_obj)[0];
    } else {
        self = MP_STATE_PORT(machine_i2s_obj)[1];
    }
    // for non-blocking operation, this IRQ-based callback handles
    // the write() method requests.
    if ((self->io_mode == NON_BLOCKING) && (self->non_blocking_descriptor.copy_in_progress)) {
        copy_appbuf_to_ringbuf_non_blocking(self);
    }

    // top half of buffer now emptied,
    // safe to fill the top half while the bottom half of buffer is being emptied
    feed_dma(self, TOP_HALF);
}

STATIC void machine_i2s_init_helper(machine_i2s_obj_t *self, size_t n_pos_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    enum {
        ARG_sck,
        ARG_ws,
        ARG_sd,
        ARG_mode,
        ARG_bits,
        ARG_format,
        ARG_rate,
        ARG_ibuf,
    };

    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_sck,      MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_ws,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_sd,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ,   {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_mode,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_format,   MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_rate,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
        { MP_QSTR_ibuf,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT,   {.u_int = -1} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_pos_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

#if 0    
    memset(&self->hi2s, 0, sizeof(self->hi2s));
#endif
    //
    // ---- Check validity of arguments ----
    //

    // are I2S pin assignments valid?
    
    const machine_pin_obj_t *pin = pin_find(args[ARG_sck].u_obj);    
    if (pin->af_list_len != 0) {
        useless_global = 1;
        mp_printf(MP_PYTHON_PRINTER, "af_list_len = %d\n", pin->af_list_len);
    }
#if 0    
    typedef struct {
        mp_obj_base_t base;
        qstr name;  // pad name
        GPIO_Type *gpio;  // gpio instance for pin
        uint32_t pin;  // pin number
        uint32_t muxRegister;
        uint32_t configRegister;
        uint8_t af_list_len;  // length of available alternate functions list
        uint8_t adc_list_len; // length of available ADC options list
        const machine_pin_af_obj_t *af_list;  // pointer to list with alternate functions
        const machine_pin_adc_obj_t *adc_list; // pointer to list with ADC options
    } machine_pin_obj_t;
#endif
    
    
    
#if 0    
    const pin_af_obj_t *pin_af;
    
    // is SCK valid?
    if (mp_obj_is_type(args[ARG_sck].u_obj, &pin_type)) {
        pin_af = pin_find_af(MP_OBJ_TO_PTR(args[ARG_sck].u_obj), AF_FN_I2S, self->i2s_id);
        if (pin_af->type != AF_PIN_TYPE_I2S_CK) {
            mp_raise_ValueError(MP_ERROR_TEXT("invalid SCK pin"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("SCK not a Pin type"));
    }

    // is WS valid?
    if (mp_obj_is_type(args[ARG_ws].u_obj, &pin_type)) {
        pin_af = pin_find_af(MP_OBJ_TO_PTR(args[ARG_ws].u_obj), AF_FN_I2S, self->i2s_id);
        if (pin_af->type != AF_PIN_TYPE_I2S_WS) {
            mp_raise_ValueError(MP_ERROR_TEXT("invalid WS pin"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("WS not a Pin type"));
    }

    // is SD valid?
    if (mp_obj_is_type(args[ARG_sd].u_obj, &pin_type)) {
        pin_af = pin_find_af(MP_OBJ_TO_PTR(args[ARG_sd].u_obj), AF_FN_I2S, self->i2s_id);
        if (pin_af->type != AF_PIN_TYPE_I2S_SD) {
            mp_raise_ValueError(MP_ERROR_TEXT("invalid SD pin"));
        }
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("SD not a Pin type"));
    }
#endif
    
    // is Mode valid?
    uint16_t i2s_mode = args[ARG_mode].u_int;
    if ((i2s_mode != (RX)) &&
        (i2s_mode != (TX))) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid mode"));
    }

    // is Bits valid?
    int8_t i2s_bits = args[ARG_bits].u_int;
    if ((i2s_bits != 16) &&
        (i2s_bits != 32)) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid bits"));
    }

